Catalogs/ПравилаПоискаДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПоискаДублейНСИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переопределяемое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПравилаПоискаДублейНСИ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЗначениеКопирования.Переопределяемое Тогда
		ТекстОшибки = НСтр("ru = 'Копирование правила по настройкам уникальности недопустимо'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;
	ЗаполнитьИдентификаторыСправочников();
	
	ПоискИЗаменаДублейНСИПереопределяемый.ПравилаПоискаДублейНСИ_ПриСозданииНаСервере(ЭтотОбъект, Отказ);
	
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗапросКорректный = ПроверитьЗапросНаСервере(Ложь);
	Если Объект.Активно И Не ЗапросКорректный Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Правило не может быть активным. Некорректный запрос'"),ТекущийОбъект, ,ТекстЗапроса, Отказ);
	КонецЕсли;
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса.ПолучитьТекст());
	СтруктураЗапроса.Вставить("ПараметрыЗапроса", Новый ХранилищеЗначения(ПараметрыЗапроса.Выгрузить(), Новый СжатиеДанных(9)));
	ТекущийОбъект.Запрос = Новый ХранилищеЗначения(СтруктураЗапроса, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписаноПравило");
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СтруктураЗапроса = ТекущийОбъект.Запрос.Получить();
	Если ТипЗнч(СтруктураЗапроса) = Тип("Структура") Тогда
		ТекстЗапроса.УстановитьТекст(СтруктураЗапроса.ТекстЗапроса);
		Если СтруктураЗапроса.Свойство("ПараметрыЗапроса") Тогда
			ПараметрыЗапроса.Загрузить(СтруктураЗапроса.ПараметрыЗапроса.Получить());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	Модифицированность = Истина; 
	Объект.Изменено = Истина;
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ИдентификаторыСправочников.ВыгрузитьЗначения());
	ПараметрыПолученияДанных.Отбор = Отбор;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;  
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ЭлементОтбора.ПравоеЗначение = ГруппыИерархии();
	ЭлементОтбора.Использование = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", ПараметрыФормы,Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если Модифицированность Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьОтчетЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Для продолжения необходимо записать. Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	ОткрытьКонструкторЗапроса();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаОчистить(Команда)
	ПараметрыЗапроса.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗаполнить(Команда)
	Если ПараметрыЗапроса.Количество() Тогда
		ТекстВопроса = НСтр("ru = 'Таблица параметров будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьЗаполнениеПараметров", ЭтотОбъект),
					ТекстВопроса,
					РежимДиалогаВопрос.ДаНет,
					,
					,
					НСтр("ru = 'Заполнение параметров запроса'"));
	Иначе
		СчитатьПараметрыЗапроса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрос(Команда)
	ПроверитьЗапросНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДублиПоПравилу(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоказатьДублиПоПравилуЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Правило поиска еще не записано. Записать?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьФорму("РегистрСведений.ДублиНСИКПодтверждению.Форма.ФормаСписка", Новый Структура("Источник", Объект.Ссылка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиИЗаписатьДубли(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("НайтиИЗаписатьДублиПослеЗаписи", ЭтотОбъект),
			НСтр("ru = 'Правило еще не записано. Записать?'"),
			РежимДиалогаВопрос.ДаНет,,,,);
	Иначе
		НайтиИЗаписатьДублиПроверка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоставляемыйЗапрос(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ВосстановитьПоставляемыйЗапросПродолжение", ЭтотОбъект), 
		НСтр("ru = 'Восстановить запрос в исходное состояние?'"),
		РежимДиалогаВопрос.ДаНет,
		,
		,
		НСтр("ru = 'Сброс запроса'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекстПоставляемогоЗапроса()
	Возврат ПоискИЗаменаДублейНСИПереопределяемый.ТекстЗапросаПоставляемогоПравила(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ГруппыИерархии()
	Группы = Новый Массив;
	Группы.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Справочники"));
	Группы.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Планы видов характеристик"));
	Возврат Группы;
КонецФункции

&НаКлиенте
Процедура НайтиИЗаписатьДублиПослеЗаписи(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		НайтиИЗаписатьДублиПроверка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиИЗаписатьДублиПроверка()
	ЗапросКорректный = ПроверитьЗапросНаСервере(Ложь);
	Если Не ЗапросКорректный Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Невозможно найти дубли. Некорректный запрос'"));
		Возврат;
	КонецЕсли;
	ЕстьДублиПоПравилу = ПроверитьСуществованиеДублей(Объект.Ссылка);
	ТекстВопроса = НСтр("ru = 'По данному правилу ранее были зарегистрированы дубли. 
				|При повторном поиске все ранее найденные дубли будут удалены. Продолжить?'");
	Если ЕстьДублиПоПравилу Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("НайтиИЗаписатьДублиЗавершение", ЭтотОбъект),
					ТекстВопроса,
					РежимДиалогаВопрос.ДаНет,
					,,,);
	Иначе
		НайтиИЗаписатьДублиСервер();
		Оповестить("ОбновитьРабочееМестоУдалениеДублейНСИ");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Дубли найдены и записаны'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиИЗаписатьДублиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		НайтиИЗаписатьДублиСервер();
		Оповестить("ОбновитьРабочееМестоУдалениеДублейНСИ");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Дубли найдены и записаны'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДублиПоПравилуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ОткрытьФорму("РегистрСведений.ДублиНСИКПодтверждению.Форма.ФормаСписка", Новый Структура("Источник", Объект.Ссылка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ОткрытьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеПараметров(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗапроса.Очистить();
		СчитатьПараметрыЗапроса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса()

#Если Не МобильныйКлиент Тогда
	КонструкторЗапроса = Новый КонструкторЗапроса;
	Если Не ПустаяСтрока(ТекстЗапроса.ПолучитьТекст()) Тогда
		КонструкторЗапроса.Текст = ТекстЗапроса.ПолучитьТекст();
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ТекстЗапросаДоРедактирования",ТекстЗапроса.ПолучитьТекст());
	
    Попытка
		КонструкторЗапроса.Показать(Новый ОписаниеОповещения("ПослеРедактированияЗапроса", ЭтотОбъект, ДополнительныеПараметры));
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияЗапроса(Текст, ДополнительныеПараметры) Экспорт
	Если Не ПустаяСтрока(Текст) Тогда
		Если Не ДополнительныеПараметры.ТекстЗапросаДоРедактирования = Текст Тогда
			ТекстЗапроса.УстановитьТекст(Текст);
			СчитатьПараметрыЗапроса();
			Объект.Изменено = Истина;
			Модифицированность = Истина;
			УправлениеФормой();
		КонецЕсли;
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СчитатьПараметрыЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса.ПолучитьТекст();
	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат;
	КонецЕсли;
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	
	Для Каждого СтрПараметры Из ОписаниеПараметровЗапроса Цикл
		СчитанныйПараметр = ДобавлениеНовогоПараметра(СтрПараметры);
		
		НайденПараметр = Ложь;
		Для Индекс = 0 По ПараметрыЗапроса.Количество() - 1 Цикл
			Если НРег(ПараметрыЗапроса.Получить(Индекс).Имя) = НРег(СчитанныйПараметр.Имя) Тогда 
				НайденПараметр = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Не НайденПараметр Тогда
			ДобавитьПараметрВФорму(СчитанныйПараметр);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПараметрВФорму(ПараметрСтруктуры)
	
	Значение 	= ПараметрСтруктуры.Значение;
	Тип			= ИмяТипаИзЗначения(Значение);
	
	// Основные реквизиты.
	Элемент							= ПараметрыЗапроса.Добавить();
	Элемент.Идентификатор			= Новый УникальныйИдентификатор;
	Элемент.Имя						= ПараметрСтруктуры.Имя;
	Элемент.Тип						= Тип;
	Элемент.Значение				= Значение;
	
	// Форменные реквизиты.
	Элемент.ТипВФорме 				= Строка(ТипЗнч(Значение));
	
КонецПроцедуры	

&НаСервере
Функция ДобавлениеНовогоПараметра(ТекущийПрочитанныйПараметр)
	
	ЭлементПараметр = Новый Структура("Имя, Тип, Значение", ТекущийПрочитанныйПараметр.Имя);

	ДоступныеТипы = ТекущийПрочитанныйПараметр.ТипЗначения.Типы();
	Если ДоступныеТипы.Количество()=0 Тогда
		ЭлементПараметр.Тип = "Строка";
		ЭлементПараметр.Значение = ЗначениеВСтрокуВнутр("");
		Возврат ЭлементПараметр;
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(ДоступныеТипы.Получить(0) );
	НовоеОписаниеТипов = Новый ОписаниеТипов(Массив);
	
	Значение = НовоеОписаниеТипов.ПривестиЗначение(Неопределено);
	
	СписокДобавленныхТипов = Новый СписокЗначений;
	СформироватьСписокТипов(СписокДобавленныхТипов);
	
	Флаг = Ложь;
	СтроковоеПредставлениеТипа = Строка(ТипЗнч(Значение));
	Для Каждого ЭлементСписка Из СписокДобавленныхТипов Цикл
		Если ЭлементСписка.Представление = СтроковоеПредставлениеТипа Тогда
			Флаг = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементПараметр.Тип = ?(Флаг, СтроковоеПредставлениеТипа, XMLТип(ТипЗнч(Значение)).ИмяТипа);
	ЭлементПараметр.Значение = Значение;
	
	Возврат ЭлементПараметр;
	
КонецФункции
	
&НаСервере
Функция СформироватьСписокТипов(СписокДобавленныхТипов = Неопределено)
	
	Массив = Новый Массив;
	Массив.Добавить(ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	Массив.Добавить(Тип("ОписаниеТипов"));
	
	ДоступныеТипыДанных = Новый ОписаниеТипов(Массив);
	
	МассивТипов = ДоступныеТипыДанных.Типы();
	
	НеПримитивныеТипы = Новый СписокЗначений;
	НеПримитивныеТипы.ЗагрузитьЗначения(МассивТипов);
	НеПримитивныеТипы.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("Строка", НСтр("ru = 'Строка'"));
	СписокТипов.Добавить("Число", НСтр("ru = 'Число'"));
	СписокТипов.Добавить("Дата", НСтр("ru = 'Дата'"));
	СписокТипов.Добавить("Булево", НСтр("ru = 'Булево'"));
	СписокТипов.Добавить("Граница", НСтр("ru = 'Граница'"));
	СписокТипов.Добавить("МоментВремени", НСтр("ru = 'Момент времени'"));
	СписокТипов.Добавить("СписокЗначений", НСтр("ru = 'Список значений'"));
	СписокТипов.Добавить("ТаблицаЗначений", НСтр("ru = 'Таблица значений'"));
	
	СписокДобавленныхТипов = Новый СписокЗначений;
	СписокДобавленныхТипов = СписокТипов.Скопировать();
	
	Для каждого Стр Из НеПримитивныеТипы Цикл
		ЗначениеТипа 		= XMLТип(Стр.Значение).ИмяТипа;
		ПредставлениеТипа 	= Строка(Стр.Значение);
		СписокТипов.Добавить(ЗначениеТипа, ПредставлениеТипа);
	КонецЦикла;
	
	Возврат СписокТипов;
	
КонецФункции

&НаСервере
Функция ИмяТипаИзЗначения(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Строка") Или ТипЗначения = Тип("Неопределено") Тогда
		ИмяТипа = "Строка";
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		ИмяТипа = "Число";
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		ИмяТипа = "Булево";
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		ИмяТипа = "Дата";
	ИначеЕсли ТипЗначения = Тип("МоментВремени") Тогда
		ИмяТипа = "МоментВремени";
	ИначеЕсли ТипЗначения = Тип("ФиксированныйМассив") Тогда
		ИмяТипа = "ФиксированныйМассив";
	ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
		ИмяТипа = "ТаблицаЗначений";
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		ИмяТипа = "Структура";
	ИначеЕсли ТипЗначения = Тип("Соответствие") Тогда
		ИмяТипа = "Соответствие";
	Иначе
		ИмяТипа = xmlТип(ТипЗнч(Значение)).ИмяТипа;
	КонецЕсли;
	
	Возврат ИмяТипа;
	
КонецФункции

&НаСервере
Функция ПроверитьЗапросНаСервере(ВыводитьСообщенияПользователю = Истина)
	
	Если Объект.Переопределяемое Тогда
		Возврат Истина;
	КонецЕсли;

	СхемаЗапроса = Новый СхемаЗапроса;
	ТребуемыйТипКлючевыхПолей = ТипЗнч(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектМетаданных,"ЗначениеПустойСсылки"));
	Попытка
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса.ПолучитьТекст());
		КоличествоПакетов = 0;
		ПакетЗапросаДляАнализа = СхемаЗапроса.ПакетЗапросов[0];
		Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
			Если ТипЗнч(Пакет) = Тип("ЗапросВыбораСхемыЗапроса") И ПустаяСтрока(Пакет.ТаблицаДляПомещения) Тогда
				КоличествоПакетов = КоличествоПакетов + 1;
				ПакетЗапросаДляАнализа = Пакет;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоПакетов > 1 Тогда
			ВызватьИсключение НСтр("ru = 'В пакете запросов не должно быть больше одного запроса'");
		КонецЕсли;
		КоличествоКлючевыхПолей = 0;
		Для Каждого Поле Из ПакетЗапросаДляАнализа.Колонки Цикл
			Если Поле.ТипЗначения.СодержитТип(ТребуемыйТипКлючевыхПолей) Тогда
				КоличествоКлючевыхПолей = КоличествоКлючевыхПолей + 1;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоКлючевыхПолей < 2 Или ПакетЗапросаДляАнализа.Колонки.Количество() > 2 Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'В запросе должно быть только 2 поля с типом %1'"), Строка(ТребуемыйТипКлючевыхПолей));
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если ВыводитьСообщенияПользователю Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Запрос корректный'"));
		КонецЕсли;
	Исключение
		Если ВыводитьСообщенияПользователю Тогда
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчет()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Правило", Объект.Ссылка);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ОтчетПоДублямНСИ.ФормаОбъекта", ПараметрыОтчета);
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыСправочников()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Родитель В (&Родители)";
	Запрос.УстановитьПараметр("Родители", ГруппыИерархии());
	ИдентификаторыСправочников.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоставляемыйЗапросПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВосстановитьПоставляемыйЗапросНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоставляемыйЗапросНаСервере()
	ТекстЗапроса.УстановитьТекст(ТекстПоставляемогоЗапроса());
	Объект.Изменено = Ложь;
	Модифицированность = Истина;
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ГруппаЗапросКнопки.Видимость = Не ОбщегоНазначения.РазделениеВключено();
		Элементы.ГруппаЗапросКнопки.Видимость = Не Объект.Переопределяемое;
	Иначе
		Элементы.ГруппаЗапросКнопки.Видимость = Ложь;
	КонецЕсли; 		
	Элементы.ТекстЗапроса.Видимость = Не ОбщегоНазначения.РазделениеВключено();
	Элементы.ТекстЗапроса.Видимость = Не Объект.Переопределяемое;
	УстановитьВидимостьВосстановленияЗапроса();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеДублей(Правило)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДублиНСИКПодтверждению.Дубль) КАК КоличествоДублей
	|ИЗ
	|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
	|ГДЕ
	|	ДублиНСИКПодтверждению.Источник = &Правило";
	Запрос.УстановитьПараметр("Правило", Правило);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЕстьДубли = Выборка.КоличествоДублей > 0;
	Иначе
		ЕстьДубли = Ложь;
	КонецЕсли;
	
	Возврат ЕстьДубли;
	
КонецФункции

&НаСервере
Процедура НайтиИЗаписатьДублиСервер()
	ПоискИЗаменаДублейНСИ.ВыполнитьПоискДублейНСИ(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВосстановленияЗапроса()
	ПоставляемыйЗапросИзменен = ТекстПоставляемогоЗапроса() <> ТекстЗапроса.ПолучитьТекст();
	Элементы.ВосстановитьПоставляемыйЗапрос.Видимость =  Не ОбщегоНазначения.РазделениеВключено() 
				И Объект.Предопределенный
				И Не Объект.Переопределяемое
				И ПоставляемыйЗапросИзменен;
КонецПроцедуры

#КонецОбласти
